
Перем Сообщения Экспорт;
Перем СуперСвойство;

&Желудь
Процедура ПриСозданииОбъекта()
	
	Сообщения = Новый Массив();

	СуперСвойство = "";

КонецПроцедуры

Процедура Вывести(Знач Сообщение, УровеньСообщения) Экспорт
	Сообщения.Добавить(Сообщение + СуперСвойство);
КонецПроцедуры

Процедура Закрыть() Экспорт
	
КонецПроцедуры

Процедура УстановитьСвойство(Знач ИмяСвойства, Знач Значение) Экспорт
	Если ИмяСвойства = "suffix" Тогда
		СуперСвойство = Значение;
	КонецЕсли;
КонецПроцедуры // УстановитьСвойство()