#Использовать autumn
#Использовать asserts
#Использовать logos
#Использовать ".."
#Использовать "."

Перем мСообщенияЛога;

Процедура ПередЗапускомТеста() Экспорт

КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт

КонецПроцедуры

Функция ПодготовитьПоделку()
	Поделка = Новый Поделка();
	Поделка.ПросканироватьКаталог("tests/Классы");
	Возврат Поделка;
КонецФункции

Процедура ДобавитьСебяКакОбработчикаВывода(Лог)

	мСообщенияЛога = Новый Массив;
	Лог.ДобавитьСпособВывода(ЭтотОбъект);

КонецПроцедуры

Процедура Вывести(Знач Сообщение, УровеньСообщения) Экспорт
	мСообщенияЛога.Добавить(Сообщение);
КонецПроцедуры

Процедура Закрыть() Экспорт
	мСообщенияЛога = Неопределено;
КонецПроцедуры

&Тест
Процедура Должен_ПроверитьПолучениеЛоговРазнымиПластилинами() Экспорт
	
	// Дано 
	Поделка = ПодготовитьПоделку();
	Поделка.ЗапуститьПриложение();

	// Когда 
	КонтейнерЛога = Поделка.НайтиЖелудь("КонтейнерЛога");
	ЭкспортныйЛог = КонтейнерЛога.ЭкспортныйЛог;
	ДобавитьСебяКакОбработчикаВывода(ЭкспортныйЛог);
	ЭкспортныйЛог.УстановитьУровень(УровниЛога.Отладка);
	ЭкспортныйЛог.Информация("Запись лога");
	СообщениеЭкспортногоЛога = мСообщенияЛога[0];

	ПриватныйЛог = КонтейнерЛога.ПриватныйЛог();
	ДобавитьСебяКакОбработчикаВывода(ПриватныйЛог);
	ПриватныйЛог.УстановитьУровень(УровниЛога.Отладка);
	ПриватныйЛог.Информация("Запись лога");
	СообщениеПриватногоЛога = мСообщенияЛога[0];

	ЛогСеттером = КонтейнерЛога.ПолучитьЛогСеттером();
	ДобавитьСебяКакОбработчикаВывода(ЛогСеттером);
	ЛогСеттером.УстановитьУровень(УровниЛога.Отладка);
	ЛогСеттером.Информация("Запись лога");
	СообщениеЛогаСеттером = мСообщенияЛога[0];

	ЛогБезПрефикса = КонтейнерЛога.ЛогБезПрефикса;
	ДобавитьСебяКакОбработчикаВывода(ЛогБезПрефикса);
	ЛогБезПрефикса.УстановитьУровень(УровниЛога.Отладка);
	ЛогБезПрефикса.Информация("Запись лога");
	СообщениеЛогаБезПрефикса = мСообщенияЛога[0];

	// Тогда
	Ожидаем.Что(ЭкспортныйЛог, "тип ЭкспортныйЛог").ИмеетТип(Тип("Лог"));
	Ожидаем.Что(СообщениеЭкспортногоЛога, "сообщение залогировано корректно").Равно("ИНФОРМАЦИЯ - [1.КонтейнерЛога] - Запись лога");
	
	Ожидаем.Что(ЛогСеттером, "тип ЛогСеттером").ИмеетТип(Тип("Лог"));
	Ожидаем.Что(СообщениеЛогаСеттером, "сообщение залогировано корректно").Равно("ИНФОРМАЦИЯ - [3.КонтейнерЛога] - Запись лога");
	Ожидаем.Что(ЛогСеттером, "Логгерны не равны").Не_().Равно(ПриватныйЛог);

	Ожидаем.Что(ЛогБезПрефикса, "тип ЛогБезПрефикса").ИмеетТип(Тип("Лог"));
	Ожидаем.Что(СообщениеЛогаБезПрефикса, "сообщение залогировано корректно").Равно("ИНФОРМАЦИЯ - [КонтейнерЛога] - Запись лога");
	Ожидаем.Что(ЛогБезПрефикса, "Логгерны не равны").Не_().Равно(ЭкспортныйЛог);

	Ожидаем.Что(ПриватныйЛог, "тип ПриватныйЛог").ИмеетТип(Тип("Лог"));
	Ожидаем.Что(ЭкспортныйЛог, "Логгерны не равны").Не_().Равно(ПриватныйЛог);
	Ожидаем.Что(СообщениеПриватногоЛога, "сообщение залогировано корректно").Равно("ИНФОРМАЦИЯ - [2.КонтейнерЛога] - Запись лога");

КонецПроцедуры

&Тест
Процедура Должен_ПроверитьИнициализациюУровнейСтандартныхЛогов() Экспорт
	
	// Дано
	Поделка = Новый Поделка();

	Лог = Логирование.ПолучитьЛог("my.logger"); 
	ЛогОшибка = Логирование.ПолучитьЛог("my.logger.ERROR");
	ЛогОтладка = Логирование.ПолучитьЛог("my.logger.DEBUG"); 
	ЛогИнформация = Логирование.ПолучитьЛог("my.logger.INFO"); 
	ЛогПредупреждение = Логирование.ПолучитьЛог("my.logger.WARN"); 
	ЛогКритическаяОшибка = Логирование.ПолучитьЛог("my.logger.CRITICALERROR"); 
	ЛогОтключено = Логирование.ПолучитьЛог("my.logger.DISABLE"); 
	ЛогПоумолчанию = Логирование.ПолучитьЛог("my.logger.DEFAULT"); 

	// Когда
	Уровень = Лог.Уровень();
	УровеньОшибка = ЛогОшибка.Уровень();
	УровеньОтладка = ЛогОтладка.Уровень();
	УровеньИнформация = ЛогИнформация.Уровень();
	УровеньПредупреждение = ЛогПредупреждение.Уровень();
	УровеньКритическаяОшибка = ЛогКритическаяОшибка.Уровень();
	УровеньОтключено = ЛогОтключено.Уровень();
	УровеньПоУмлчанию = ЛогПоумолчанию.Уровень();
	
	// Тогда
	Ожидаем.Что(Уровень, "Уровень лога подтянулся из конфига").Равно(УровниЛога.Отладка);
	Ожидаем.Что(УровеньОшибка, "Уровень лога подтянулся из конфига УровеньОшибка").Равно(УровниЛога.Ошибка);
	Ожидаем.Что(УровеньОтладка, "Уровень лога подтянулся из конфига УровеньОтладка").Равно(УровниЛога.Отладка);
	Ожидаем.Что(УровеньИнформация, "Уровень лога подтянулся из конфига УровеньИнформация").Равно(УровниЛога.Информация);
	Ожидаем.Что(УровеньПредупреждение, "Уровень лога подтянулся из конфига УровеньПредупреждение").Равно(УровниЛога.Предупреждение);
	Ожидаем.Что(УровеньКритическаяОшибка, "Уровень лога подтянулся из конфига УровеньКритическаяОшибка").Равно(УровниЛога.КритичнаяОшибка);
	Ожидаем.Что(УровеньОтключено, "Уровень лога подтянулся из конфига УровеньОтключено").Равно(УровниЛога.Отключить);
	Ожидаем.Что(УровеньПоУмлчанию, "Уровень лога подтянулся из конфига УровеньПоУмлчанию").Равно(УровниЛога.Отладка);

КонецПроцедуры



